yu123an/esp8266/ESp8266_ws2812_clokc.c
#include <SPI.h>
#include <NTPClient.h>

#include <ESP8266WiFi.h>

#include <WiFiUdp.h>

const char *ssid     = "WiFiname";
const char *password = "WiFipass";

WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP);
uint8_t number[20][8] = {
  {0x00,0x00,0x3e,0x82,0x41,0x82,0x3e,0x00},//num0
  {0x00,0x00,0x00,0x00,0x21,0xfe,0x01,0x00},//num1
  {0x00,0x00,0x27,0xa2,0x45,0xa2,0x39,0x00},//num2
  {0x00,0x00,0x22,0x92,0x49,0x92,0x36,0x00},//num3
  {0x00,0x00,0x0c,0x28,0x24,0xfe,0x04,0x00},//num4
  {0x00,0x00,0x72,0x8a,0x51,0x8a,0x4e,0x00},//num5
  {0x00,0x00,0x3e,0xa2,0x45,0xa2,0x26,0x00},//num6
  {0x00,0x00,0x40,0x02,0x40,0xf2,0x70,0x00},//num7
  {0x00,0x00,0x36,0x92,0x49,0x92,0x36,0x00},//num8
  {0x00,0x00,0x32,0x92,0x49,0x92,0x3e,0x00},//num9
  {0x22,0x00,0x3e,0x82,0x41,0x82,0x3e,0x00},//num10
  {0x22,0x00,0x00,0x00,0x21,0xfe,0x01,0x00},//num11
  {0x22,0x00,0x27,0xa2,0x45,0xa2,0x39,0x00},//num12
  {0x22,0x00,0x22,0x92,0x49,0x92,0x36,0x00},//num13
  {0x22,0x00,0x0c,0x28,0x24,0xfe,0x04,0x00},//num14
  {0x22,0x00,0x72,0x8a,0x51,0x8a,0x4e,0x00},//num15
  {0x22,0x00,0x3e,0xa2,0x45,0xa2,0x26,0x00},//num16
  {0x22,0x00,0x40,0x02,0x40,0xf2,0x70,0x00},//num17
  {0x22,0x00,0x36,0x92,0x49,0x92,0x36,0x00},//num18
  {0x22,0x00,0x32,0x92,0x49,0x92,0x3e,0x00},//num19
};
uint8_t litnumber[10][4] = {
  {0x00,0xf8,0x11,0xf8}, //litnum0
  {0x00,0x90,0x1f,0x80}, //litnum1
  {0x00,0xe8,0x15,0xb8}, //litnum2
  {0x00,0xa8,0x15,0xf8}, //litnum3
  {0x00,0x38,0x04,0xf8}, //litnum4
  {0x00,0xb8,0x15,0xe8}, //litnum5
  {0x00,0xf8,0x15,0xe8}, //litnum6
  {0x00,0x08,0x10,0xf8}, //litnum7
  {0x00,0xf8,0x15,0xf8}, //litnum8
  {0x00,0xb8,0x15,0xf8}, //litnum9
};
void write_byte(uint8_t num) {
  for (int i = 0; i <= 7; i++) {
    if (num & 0x80) {
      SPI.transfer(0x7c);
    } else {
      SPI.transfer(0x70);
    }
    num <<= 1;
  }
}
void write_led(uint8_t numa, uint8_t numb, uint8_t numc) {
  write_byte(numa);
  write_byte(numb);
  write_byte(numc);
}
void write_num(uint8_t data) {
  for (int i = 0; i <= 7; i++) {
    int aa = number[data][i];
    for (int j = 0; j <= 7; j++) {
      if (aa & 0x80) {
        write_led(0, 0, 15);
      } else {
        write_led(0, 0, 0);
      }
      aa <<= 1;
    }
  }
}
void write_litnum(uint8_t data) {
  for (int i = 0; i <= 3; i++) {
    int aa = litnumber[data][i];
    for (int j = 0; j <= 7; j++) {
      if (aa & 0x80) {
        write_led(0, 0, 15);
      } else {
        write_led(0, 0, 0);
      }
      aa <<= 1;
    }
  }
}
void setup() {
SPI.begin();
SPI.setFrequency(8000000);  //8MHzSPI

  Serial.begin(115200);

  WiFi.begin(ssid, password);

  while ( WiFi.status() != WL_CONNECTED ) {
    delay ( 500 );
    Serial.print ( "." );
  }

  timeClient.begin();
  
}

void loop() {
  // put your main code here, to run repeatedly:

  timeClient.update();
  write_num(timeClient.getHours() / 10);
  write_num(timeClient.getHours() % 10);
  write_num(timeClient.getMinutes() / 10);
  write_num(timeClient.getMinutes() % 10);
  write_litnum(timeClient.getSeconds() / 10);
  write_litnum(timeClient.getSeconds() % 10);
  delay(500);
  write_num(timeClient.getHours() / 10);
  write_num(timeClient.getHours() % 10);
  write_num(timeClient.getMinutes() / 10 + 10);
  write_num(timeClient.getMinutes() % 10);
  write_litnum(timeClient.getSeconds() / 10);
  write_litnum(timeClient.getSeconds() % 10);
  delay(500);
}
